cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/versions'

brew 'ccat'
brew 'coreutils'
brew 'httrack'
brew 'imagemagick'
brew 'node'
brew 'openssl'
brew 'pandoc'
brew 'pandoc-citeproc'
brew 'pandoc-cross-ref'
brew 'racket'
brew 'readline'
brew 'tree'
brew 'unrar'
brew 'wget'

# Essentials
cask '1password'
cask 'sublime-text-dev'
cask 'dropbox'
cask 'iterm2'
cask 'launchbar'
cask 'fantastical'
cask 'google-chrome'
cask 'polymail'
cask 'slack'
cask 'spotify'
cask 'papers'

# Utilities
cask 'bartender'
cask 'bettertouchtool'
cask 'caffeine'
cask 'cheatsheet'
cask 'cloudup'
cask 'flux'
cask 'hazel'
cask 'the-unarchiver'

# Nice to have
cask 'sketch'
cask 'transmission'
cask 'mactex'
