cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/versions'

brew 'bear'
brew 'clang-format'
brew 'cmake'
brew 'coreutils'
brew 'fasd'
brew 'fzf'
brew 'gcc'
brew 'grip'
brew 'htop'
brew 'hub'
brew 'neovim'
brew 'node'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'source-highlight'
brew 'terminal-notifier'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'zsh'

# brew 'racket'
# brew 'graphicsmagick'
# brew 'httrack'
# brew 'pandoc'
# brew 'pandoc-citeproc'
# brew 'pandoc-crossref'

# Essentials
cask '1password'
cask 'iterm2'
cask 'bear'
cask 'bettertouchtool'
cask 'dropbox'
cask 'google-chrome'
cask 'launchbar'
cask 'bartender'
cask 'fantastical'
cask 'polymail'
cask 'sublime-text-dev'
cask 'slack'
cask 'spotify'
cask 'papers'

# Utilities
cask 'caffeine'
cask 'cloudup'
cask 'flux'
cask 'hazel'

# Nice to have
# cask 'sketch'
# cask 'transmission'
