cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/versions'

brew 'bear'
brew 'ccat'
brew 'coreutils'
brew 'fasd'
brew 'fzf'
brew 'gcc'
brew 'graphicsmagick'
brew 'httrack'
brew 'hub'
brew 'imagemagick'
brew 'itermocil'
brew 'TomAnthony/brews/itermocil'
brew 'node'
brew 'numpy'
brew 'neovim'
brew 'openssl'
brew 'pandoc'
brew 'pandoc-citeproc'
brew 'pandoc-cross-ref'
brew 'racket'
brew 'readline'
brew 'ripgrep'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'zsh'

# Essentials
cask '1password'
cask 'sublime-text-dev'
cask 'dropbox'
cask 'iterm2'
cask 'launchbar'
cask 'fantastical'
cask 'google-chrome'
cask 'polymail'
cask 'slack'
cask 'spotify'
cask 'papers'
cask 'mactex'

# Utilities
cask 'bartender'
cask 'bettertouchtool'
cask 'caffeine'
cask 'cloudup'
cask 'flux'
cask 'hazel'
cask 'the-unarchiver'

# Nice to have
# cask 'sketch'
# cask 'transmission'
